{
    "title": "Advice For First-Time Chicken Owners",
    "date": "1460884419809",
    "content": "Every day, Backyard Chickens (BYC) Community receives hundreds of questions from old and new chicken raisers. Since BYC is a terrific source of practical and useful information, we decided to ask for tips from our friendly and helpful members on how to take care of our beloved flocks.\n \nBuying your Flock\n \nThere is a lot of differing opinions on where is the best place to buy your chicken. Some will say it's best to buy chicks from hatcheries.  Others would suggest you buy from a reputable breeder. Then there are feed stores, shows, meet-ups… Here are some points to consider before making your decision:\n \n•  First, know what role you expect your chickens to play. Do you want them to be meat producers? Do you want them for meat and eggs?  Do you want them simply for eggs?  Deciding this before buying your chickens will help you determine what type of breed to buy, the kind of coop that you will need, etc. This article will help you choose the breed that is right for you.\n•  Be careful when buying chickens at a swap meet or from someone you don’t personally know. You might end up getting a diseased bird or a bird with some health issues, or an older hen that is past her productive years. If possible, take a more experienced poultry keeper with you advice you when purchasing birds.\n•  Decide on what breeds you really want to get and stick to them. A flock with a mix of breeds can sound tempting, but some breeds do not mix well together. If you are planning to have more than one breed, do some research before buying new birds.\n•  Plan ahead. Remember that chicks grow very quickly.  Don't buy too many chicks at once because you may not have room for all of them. Make sure you have a big enough brooder for them to stay in for up to 6 weeks.\n•  Pick a breed appeals best to you, you're the one that has to take care of them everyday rain or shine. You'll do better with them, be happier, and stay with poultry longer.  Extreme climate?  If you want them bad enough you can make them work.  Chickens are a lot tougher than people give them credit for.\n \n**When Adding Chickens to your existing Flock**\n \nWhen adding new chickens to your flock, make sure to quarantine them away from your existing flock.  Keeping the new chickens away from the old will lessen the risk of the old contracting any disease or pest the new birds may carry.  It is recommended to keep them quarantined for a month, just to be on the safe side. \n \nProviding a Comfortable Coop for your Chickens\n \nBefore you buy your chickens, make sure you build/buy them a decent home.  In building a coop, here are some tips that will surely be helpful:\n \n• The number one advise chicken expert will give you in building a coop is to make it the biggest that it could be.  As you get the hang of raising your chickens, you will have an addiction of adding members to your flock every now and then. From 3 chickens, you’ll find yourself tending for 10-15 chickens in no time.  You can always build a temporary wall if it's too large, but building additions is much more difficult.  So, make your coop bigger! This article give a good rundown on how to manage space in the coop.\n• Remember these three important things when making a coop: dryness, cleanliness and ventilation. Your chickens must be kept in a dry coop to help control disease and health issues. Also, give your coop as much ventilation as you can, without making it draughty. A dirty coop and a pile of wet droppings can provide a perfect breeding ground for disease, so keep the coop clean and the dirt under control.\n• A bed of straw in the floor of your coop could quickly turn into a dusty, moldy, poopy mess. Pine shavings are a better choice. Pine chips are even better.\n• Pine shavings in a nest box don’t usually work out well. They will scratch it all out onto the floor. For nest boxes, straw would be a better choice.\n• Putting newspaper under a pile of shavings or bedding in the coop means that you can roll up the poop and remove everything at once, making cleaning the coop much easier.\n• Lastly, make sure that all coops are PREDATOR PROOF! Use heavy gauge hardware cloth and try to avoid chicken wire. Chicken wire does not stand the test of time and your chickens, especially the roosters might injure their combs when they stick their heads through the wire. Coyotes and dogs can chew right through most chicken wire. Here are some tips on preventing losses to common chicken predators and pests.\n• If you are the DIY type, visit the coops section for brooder and coop designs.\n \nTaking Care of your Chickens\n \nNow that you’ve bought your chicks and built them a great home, all you have to do is know how to take care of them. Here are some of the tips that our members came up with:\n \n• If you are a newbie, it is recommended to ask questions from those that have been there the longest, then follow their advice. There is no substitute for experience as it is the best teacher and what sounds good in theory over multiple decades may not always turn out the best.\n• Chickens will eat anything! They are living garbage disposals. They will eat anything from burnt food, leftover food, fish carcasses, pumpkin rinds, etc. Just make sure not to feed them toxic and poisonous foods and plants. This chicken treat chart is full of suggestions for safe, healthy chicken treats.\n• Feed a good balanced commercial feed (preferably with some sort of animal protein, chickens are omnivores).  If you're not a nutritionist, don't mix your own feed, and don't let supplements or 'treats' make up more than about 10% of the food you provide for your birds.\n• It's best to ensure that all their basic needs are met before winter hits - especially if you're in a northern climate. This thread has some checklists, tips and advice to help you prepare for your first winter.\n• Buy water heaters for your chicks before winter hits.  Also, make sure to try them out before winter to see if they work properly.  \n• Don't wait until it's dark to put the chickens inside the coop.  This is when a lot of predators attack so make sure you tuck them in early.\n• There is always one chicken that will resist your efforts to get them inside the coop, when you really need to get them inside. Make sure everyone's inside before locking them up for the night.\n• Keep everything clean.  Cleanliness in the area may be harder to maintain with all the poop but remember to clean out their coop, run, feeders and waterers as needed. This will keep them cleaner and less likely to get parasites or get sick.\n• Chicks can drown easily in water bowls. Fill water bowls with clean pebbles or marbles to prevent accidental drownings. \n• If you want to be able to pick your chickens up and pet them, you have to start doing so right away and on a regular basis.  This will help them to get used to being handled.\n• An unsupervised chicken flock can create destruction in your landscape garden quicker than you can imagine.  Say hello to uprooted plants, gravel all over the place and dirt craters.\n• Spent time getting to know your birds. Watch their behaviour, droppings etc. It can save their lives if you're able to notice the even the slightest warning signs early on. \n• Almost any dog coming across free range chickens, will kill chickens. Supervise and/or train your dog(s) to leave chickens alone.\n• Clipping the wing does not always keep chickens from flying. It often only slows them down. This article explains how to clip and trim chicken wings to prevent flight.\n• Put together a sufficient first aid, preventive and medical kit for your birds. See here for more on chicken first aid kits - handy and essential supplies, and how to use them.\n• Lice and mites are a common and fatal issue whether you have 5 chickens or 500. Make sure you take the necessary precautions.\n• Deworm your chickens regularly. Some poultry keepers recommend deworming every 6 months.\n• If your hen is laying eggs, feed it a premium quality layer feed with additional calcium and that should do it. Keep feed available all the time so they can eat how much they want/need (especially during winter). \n• If you notice something off about your chicken, do a check up right away! \n• Check the body weight, color of the comb & wattles, crops and droppings of your chickens regularly and make sure you know what it should look and/or feel like.  When you see that something is not right with your chicken, isolate it immediately.\n• Be sure to separate any sick birds from the flock at the first sign of illness. You don’t want other chicks to get the disease too.\n• Make sure a sick chicken eats and drinks sufficiently.  This may sound like common sense but it can take all the difference between life and death within a few short days.\n• If needed, your house could be the perfect make-shift coop for ill and injured chickens. \n• Consider vaccinating home hatched chicks and ask hatcheries if they vaccinated the chicks before shipping and for what diseases. Vaccinations can save you a lot of losses and heartache in the long run."
}
