{
    "title": "Discouraging Bullying Chicken Behavior",
    "date": "1460883419809",
    "content": "Bullying is a very common issue that occurs mainly in times of stress or boredom, such as when two flocks are being integrated or the coop is too small. However harmless it may seem, when left unchecked, bullying can cause severe injury and even death.\n\nBoredom is a frequent cause of bullying. Ideally, birds would spend “up to 65% of their day foraging” (Dr. Bas Rodenburg), and when they do not have the ability to forage they find other less productive activities, such as pecking. This can be countered by more outside time in a pen or free ranging. However, in the winter, when some may not have access to the outdoors, other measures must be taken.    \n\nOne study found a relationship between housing chickens on wire floor and pecking. Chickens who were raised on wire were more likely to begin pecking than chickens raised in a different substrate. This is probably related to the lack of activities such as scratching.\n\nIf you notice that one dominant chicken has been bullying the others, that chicken can be removed and put in solitary confinement for a few days up to a week. X-Pen or dog cage can be used as a pen. When the chicken returns, they will be at the bottom of the pecking order. \n\nIf you notice only occasional bullying behavior, fill a tin can with pebbles and pennies, then put duct tape over the top. Keep this by the coop. Whenever you see bullying behavior, immediately shake the can. The chickens will stop what they’re doing to find out what that awful noise is. If you do this consistently, they should stop.\n\nTo avoid bullying when introducing chickens, first allow the flocks to see each other through a fence. After they have become accustomed to each other, allow them to interact while free ranging. The extra space and distractions will allow the newcomers to escape if they are pecked. Then, it is best to leave them in the coop at night when they are sleeping. The two flocks should also be comparable in size before being integrated. For example, 1 week old Wyandottes should not be put with a flock of 3 year old Jersey Giants.\n\nBlinders are a device used to obscure a chicken’s view so they cannot accurately peck another chicken. However, these are not commonly used in backyard flocks.\n\nExcessive light exposure can also be a cause of pecking. Lights should be on for less than sixteen hours per day for adult birds. Also, a red lamp should be used in the brooder, ideally without any additional light, which will decrease the amount of pecking. Another cause of pecking in chicks is overheating. The heat lamp should be raised or lowered so that the birds are evenly dispersed throughout the brooder, not huddled under the heat or scattered to the sides.\n\nChickens must have adequate space to prevent bullying.Overcrowding is a surefire way to start pecking issues. If your coop is not as big as you’d like, at least allow the chickens to free range each day to diffuse the tension. Also make sure that there are enough feeders and waterers to go around because a lack of food can cause cause stress that can lead to pecking.\n\nIf a chicken has an injury from pecking, remove the bird and ideally, keep them in a separate area until they heal. However gruesome it is, other chickens will notice the blood on the area and peck it more. If you are not able to remove the chicken, clean the wound with saline solution and apply an antiseptic spray such as Blu-Kote that will not only keep the wound clean, but will also conceal the wound. You can also use an anti-picking solution that will help discourage the birds from pecking at it.\n\nMonitor birds frequently for any patches of lost feathers that could indicate bullying. If you are vigilant about keeping their environment interesting and reducing stress, the problem should sort itself out quickly."
}
