{
    "title": "Raising Baby Chickens - The First 60 Days",
    "date": "1460882719809",
    "content": "The chick's first home will be the brooder. For brooder designs and ideas see our chicken brooders section. The size of the brooder will depend on the number of chicks you have. Aim for at least 2.5 sq feet per chick, if possible, more is better. The bottom of the brooder should have a layer of clean litter (pine shavings or similar). For very small chicks paper towels over wood shavings is recommended. Newspaper is slippery underfoot and can cause foot or leg problems in chicks. Therefor it is not suitable for a brooder floor cover. The litter should be changed out every couple of days, and never allowed to remain damp - cleanliness is VERY important at this stage. Baby chicks are prone to a number of diseases, such as Coccidiosis, which thrives in a damp environment. This and other chick health problems can be avoided with proper sanitation. When the chick are around a month old, add a low roost about 4\" off the floor of the brooder to encourage the chicks to start roosting. Don't put it directly under the heat lamp, it will be too warm there.\n\nTemperature\n\nThe brooder can be heated by using a light bulb with a reflector, available at any hardware store. A 100-watt bulb is usually fine, though some people use an actual heat lamp. The temperature should be 90-95 degrees for the first week in the warmest part of the brooder and should be reduced by around 5 degrees each week thereafter, until the chicks have their feathers (5-8 weeks old). A thermometer in the brooder is helpful, but you can tell if the temperature is right by how the chicks behave. If they are panting and/or huddling in corners farthest from the light, they are too hot. If they huddle together in a ball under the light, they are too cold. You can adjust the distance of the light (or change the wattage of the bulb) until it's right. Make sure you always cooler spots in the brooder where the chicks can cool down if they feel the need to.\n\nFood and water\n\nMake sure you always have fresh, clean water available for your chicks. Place the waterer as far as possible away from the heat lamp and if you are using a bowl, fill it with marbles or clean pebbles to help prevent the chicks from drowning or getting soaked if they accidentally fall in.\n\nEven baby chicks will naturally scratch at their food, so a feeder that (more or less) keeps the food in one place is good. The feeder shown is a popular design made of galvanized steel; the top slides off to clean and fill it. Again, cleanliness is important; the chicks will poop right into their own food, so you must clean and refill it often. Chicks start out with food called \"crumbles\". It is specially formulated for their dietary needs; it comes both medicated or not. Medicated feed is usually medicated with a small amount of Amprolium drugs, which helps prevent Coccidiosis. If you choose non-medicated feed, pay more attention to cleanliness. Chick crumbles is a complete food - no other food is necessary. However, feeding your chicks treats can be fun. After the first week or two, you can give them small amounts of treats every day. Remember when feeding treats to offer the chicks grit to help them break down the new food. If you cannot find chick size grit, coarse sand works just as well.\n\nPlay Time\n\nChicks are insatiably curious - after the first week or two, they can be put outside for short periods of time if the temperature is warm. They MUST be watched at this age, however. Chicks can move fast, squeeze into small spaces, and are helpless against a variety of predators, including the family dog or cat. If they have bonded to you (the first large thing a baby chicks sees is forever it's 'mama', this is called \"imprinting\"), they will follow you around. Chickens become fond of their owners; some will come when you call them (and some won't!).\n\nKeeping chicks healthy\n\nChicks are prone to a condition called \"pasty butt\" where dropings stick to their vents and clog it up, making it impossible for them to relieve themselves. If left untreated this can kill them. Check your chicks' bottoms every few hours, especially during the first 2 weeks. If you find a pasty bottom carefully soak and remove the plug, pat the area and dry and apply a little vaseline or vegetable oil to the area. Organic ACV (apple cider vinegar) in their drink water is found to really help prevent this condition. A ratio of 3-4 tablespoons to a gallon water is recommended.\n\nFor more on raising chicks see the Raising Baby Chicks section of the forum.\n"
}
