{
    "title": "Cleaning Eggs",
    "date": "1460884719809",
    "content": "Sometimes, in spite of our efforts to provide a nice clean spot for our feathered friends to deposit the rent in, we'll get a dirty egg or two. That brings with it the question: to clean or not to clean and if so, what is the best way to clean it? In an informal survey on the forum we found that our members' opinions are 50/50 on whether or not to clean eggs and everyone has reasons for their preference. Some are worried about hygiene, some are not hassled about a little dirt, other don't want to sell/give away soiled eggs to friends and neighbours and others are worried that dirty eggs stored in the fridge will contaminate other foodstuff, such as milk. The best way to solve the dilemma of the dirty egg is to prevent it from happening in the first place. That being said, it's often easier said than done, but a few basic preventative steps can make a huge difference:\n\n- Make sure the nest boxes are filled with clean straw/shavings/whatever your preferred material. Check and remove soiled material and droppings often.\n- With the exception of broody hens, don't allow your birds to sleep in the nest boxes. Nest boxes are for laying eggs in and perches are for sleeping on. Make sure perches are placed higher than next boxes in the coop, to minimise temptation.\n- Try to keep dirt and mud in the coop and run to a minimum. Hens with dirty feet visiting the nest boxes to lay will mess the boxes and any eggs already in there up quickly.\n\nIf, in spite of these precautions, you get a dirty egg and you really want/need to clean it, here are some tips: Washing the egg will take care of the dirt, but... it will also remove the natural, anti-bacterial coating on the shell, called the 'bloom' making it more susceptible to bacteria and spoilage. So, if possible use a dry cleaning method, for example give the egg shell a light buff with an abrasive cleaning pad (keep a special pad in the kitchen for this purpose only). If the egg is too dirty, for example, if an egg broke in the nest box and the intact eggs have yolk and worse smeared all over them, wash the eggs under warm, running water. Cold water will cause the contents of the egg to shrink, creating a vacuum that will pull bacteria and other nasties into the egg through the porous egg shell. Warm water, on the other hand, will cause the contents to expand against the shell, preventing bacteria from entering. Do not soak eggs in the water and after washing store them in a cool place, preferably the fridge and use them before any unwashed, clean eggs. It is not necessary to use soap, bleach, vinegar or any cleaning materials when washing eggs. Warm water is enough.\n\nRead more: http://www.backyardchickens.com/t/685869/do-you-wash-fresh-eggs-refrigerate-or-no\n\nStoring eggs\n\nAccording to an old joke, the best way to keep an egg fresh, is to keep it inside the hen. Unfortunately that is not an option! Most chicken owners get fresh eggs daily and use them within a week. Fresh laid eggs will be quite fine sitting out on the kitchen counter for up to a month, depending on the temperature in your kitchen, but after two weeks the quality will have dropped noticeably. For longer storage and for washed eggs, storage in a cool place, like the fridge, is recommended. Eggs will stay fresher even longer in the fridge if stored in egg cartons, which will minimise moisture loss through their porous shells. \n\n**Did you know commercial egg farmers have 30 days from the day an egg is laid to get it to stores. Then, the stores have another 30 days to sell the eggs. The USDA recommends a maximum of 5 weeks in your refrigerator before you discard your eggs. What does this all boil down to? On April 1, you could be eating an egg that was laid on Christmas :ep Another good reason to keep your own hens for eggs! But it goes to show that under correct storage conditions, eggs can last and stay quite edible for months.\n\nRead more: http://www.backyardchickens.com/t/175295/how-long-do-fresh-eggs-stay-fresh\n\nAnother long term storage option is freezing. This method works quite well, but freezing and defrosting wreaks havoc on the quality of the egg contents.\n\nRead more: http://www.backyardchickens.com/t/732187/freezing-eggs\n\nFor more on eggs, egg laying and storage visit our Chicken Behaviors and Egglaying and Egg, Chicken, & Other Favorite Recipes forum sections."
}
