{
    "title": "How To Protect Your Chickens From Eagles",
    "date": "1460885419809",
    "content": "Eagles are the un-proclaimed kings and queens of the bird kingdom. These impressive birds of prey are members of the Accipitridae family. Only a few types of condors and vultures can beat the eagle in terms of size and even the smallest eagles are unmatched in terms of weight, length and wing span. Considered as the fiercest birds of prey, they sit on the apex of the food chain and they feed on a variety of animals which include fish, deer, snake, monkey, rodents and of course, other birds.  Despite the absence of aerodynamic feathers, eagles fly faster than other birds. They have strong, muscular legs, powerful talons and large, hooked beaks which are typically heavier than that of most other birds of prey. Eagles also have extremely powerful eyesight, which allows them to spot a prey from great distances. All this combined makes them excellent hunters. \n \nRange\n \nThere are more than 60 eagle species and the majority of them can be found in Eurasia and Africa. Only 11 species of eagles are found outside of these 2 continents – 2 in North America, 15 in Central and South America and 3 in Australia. The Golden eagle and the Bald eagle – the national bird and national animal of the United States – can be found in the majority of Canada and Alaska, across the U.S. and in Northern Mexico. Bald eagles usually find habitat near large bodies of water where food is abundant and a lot of old-growth trees can be found. They prefer to build their aeries in this type of habitat.\n \nKill Method\n \nEagles are fast and powerful birds in flight. The Bald eagle for instance can reach a dive speed of 160 kilometers per hour, picking up a prey in one fast swoop. At first contact, eagles tear through the flesh of their prey with their sharp and powerful talons, often killing their prey instantly. Some may also break their prey's spinal cord with their powerful, hard beak. Most eagles grab their prey and take it somewhere where they will proceed to tear it apart with their strong beaks and eat it at their leisure. \n \nPrevention and Treatment\n \nMore than 50% of an eagle’s diet comes from fish and carrion and they don’t usually hover around backyards to hunt domestic chickens. However, eagles are opportunistic feeders and they will take advantage of whatever food is available. Given the opportunity eagles will hunt chickens and other backyard poultry. Therefore preventative steps should be taken by poultry owners to keep eagles away from your flock. The easiest way for poultry keepers to protect their flock is by putting up overhead netting, or a similar type of type of cover over their run to prevent birds of prey from swooping in. If your flock free range make sure they have sheltered spots when they can take cover if needed. A number of flock owners use old CDs and other reflective materials to scare off hawks and this should also work for eagles. You can also buy decoys or fake baits to lure eagles away from your flock. If you don't mind the noise, Guinea hens make for a great alarm system when eagles come visiting.\n \nPlease note that eagles and most other birds of prey are protected by law and shooting them may land you in big trouble. If you do have a problem with eagle predation in your flock, rather look into other preventative measures to protect your flock. \n \nFor more discussions on eagles and how to deter them and how to protect your flock, see the predators and pests section of the forum."
}
